[Killed] BlockStatement
main/components/Meals/MealsTable.js:4:47
 import React from "react";
 import OurTable from "main/components/OurTable";
 
-export default function MealsTable({ meals }) {
-  // Stryker disable all : hard to test for query caching
-
-  // Stryker restore all
-
-  // Stryker disable next-line all : TODO try to make a good test for this
-
-  const columns = [
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Code",
-      accessor: "code",
-    },
-  ];
-
-  return <OurTable data={meals} columns={columns} testid={"MealsTable"} />;
-}
+export default function MealsTable({ meals }) {}
 
killedBy: MealsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
