[Killed] BlockStatement
main/pages/DiningCommons/DiningCommonsPage.js:3:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function DiningCommonsPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Placeholder for Dining Commons Page</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function DiningCommonsPage() {}
 
killedBy: PlaceholderIndexPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Placeholder for Dining Commons Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
