[Killed] BlockStatement
main/pages/UCSBAPIDiningCommons/UCSBAPIDiningCommonsPlaceholderPage.js:5:41
 import { useParams } from "react-router-dom";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-function DiningCommonsPlaceholderPage() {
-  const { diningCommonsCode } = useParams();
-
-  return (
-    <BasicLayout>
-      <h1>Placeholder for Dining Commons Page</h1>
-      <p>This is the placeholder page for {diningCommonsCode}</p>
-    </BasicLayout>
-  );
-}
+function DiningCommonsPlaceholderPage() {}
 
 export default DiningCommonsPlaceholderPage;
killedBy: DiningCommonsPlaceholderPage tests renders placeholder text with given diningCommonsCode
statusReason: TestingLibraryElementError: Unable to find an element with the text: Placeholder for Dining Commons Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
