[Killed] StringLiteral
main/components/MenuItems/MenuItemsTable.js:31:17
     },
     {
       Header: "Meal",
-      accessor: "meal",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemsTable-cell-row-0-col-meal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/MenuItems/MenuItemsTable.js:33:5
       Header: "Meal",
       accessor: "meal",
     },
-    {
-      Header: "ItemName",
-      accessor: "itemName",
-    },
+    {},
     {
       Header: "Station",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
