[Killed] BlockStatement
main/pages/MyReviews/MyReviewsPage.js:3:41
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MyReviewsPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>This page will eventually show all reviews entered by the user</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MyReviewsPage() {}
 
killedBy: MyReviewsPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: This page will eventually show all reviews entered by the user. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
