[Killed] BlockStatement
main/components/Meals/MealsTable.js:4:47
 import React from "react";
 import OurTable from "main/components/OurTable";
 
-export default function MealsTable({ meals }) {
-  const columns = [
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Code",
-      accessor: "code",
-    },
-  ];
-
-  return <OurTable data={meals} columns={columns} testid={"MealsTable"} />;
-}
+export default function MealsTable({ meals }) {}
 
killedBy: MealsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrayDeclaration
main/components/Meals/MealsTable.js:5:19
 import OurTable from "main/components/OurTable";
 
 export default function MealsTable({ meals }) {
-  const columns = [
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Code",
-      accessor: "code",
-    },
-  ];
+  const columns = [];
 
   return <OurTable data={meals} columns={columns} testid={"MealsTable"} />;
killedBy: MealsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Meals/MealsTable.js:10:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Code",
-      accessor: "code",
-    },
+    {},
   ];
 
killedBy: MealsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Meals/MealsTable.js:16:59
     },
   ];
 
-  return <OurTable data={meals} columns={columns} testid={"MealsTable"} />;
+  return <OurTable data={meals} columns={columns} testid={""} />;
 }
 
killedBy: MealsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MealsTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
