[Killed] BlockStatement
main/components/MenuItems/MenuItemsTable.js:9:37
 export default function MenuItemsTable({ menuItems }) {
   const _navigate = useNavigate();
 
-  const reviewCallback = (_cell) => {
-    //navigate(`/menuitems/review/${cell.row.values.id}`);
-    window.alert("Feature coming soon!");
-  };
+  const reviewCallback = (_cell) => {};
 
   const columns = [
killedBy: UserTable tests Review this item button brings up a window.alert('Feature coming soon!') message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Feature coming soon!"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/MenuItems/MenuItemsTable.js:11:18
 
   const reviewCallback = (_cell) => {
     //navigate(`/menuitems/review/${cell.row.values.id}`);
-    window.alert("Feature coming soon!");
+    window.alert("");
   };
 
killedBy: UserTable tests Review this item button brings up a window.alert('Feature coming soon!') message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Feature coming soon!"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/MenuItems/MenuItemsTable.js:29:17
     },
     {
       Header: "ItemName",
-      accessor: "itemName",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemsTable-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MenuItems/MenuItemsTable.js:39:7
 
   columns.push(
     ButtonColumn(
-      "Review this item",
+      "",
       "primary",
       reviewCallback,
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItems/MenuItemsTable.js:40:7
   columns.push(
     ButtonColumn(
       "Review this item",
-      "primary",
+      "",
       reviewCallback,
       "MenuItemsTable",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/MenuItems/MenuItemsTable.js:42:7
       "Review this item",
       "primary",
       reviewCallback,
-      "MenuItemsTable",
+      "",
     ),
   );
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemsTable-cell-row-0-col-Review this item-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
