[Killed] ObjectLiteral
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:14:5
       Header: "Name",
       accessor: "name",
     },
-    {
-      Header: "Code",
-      accessor: "code",
-      Cell: ({ value }) => <Link to={`/diningcommons/${value}`}>{value}</Link>,
-    },
+    {},
     {
       Header: "Location",
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:19:5
       accessor: "code",
       Cell: ({ value }) => <Link to={`/diningcommons/${value}`}>{value}</Link>,
     },
-    {
-      Header: "Location",
-      accessor: (row) => `${row.location.latitude}, ${row.location.longitude}`,
-    },
+    {},
     {
       Header: "Has Sack Meal",
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:21:17
     },
     {
       Header: "Location",
-      accessor: (row) => `${row.location.latitude}, ${row.location.longitude}`,
+      accessor: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests renders table with data correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  34.410987, -119.84709
Received:

[Killed] ObjectLiteral
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:23:5
       Header: "Location",
       accessor: (row) => `${row.location.latitude}, ${row.location.longitude}`,
     },
-    {
-      Header: "Has Sack Meal",
-      accessor: "hasSackMeal",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
-    },
+    {},
     {
       Header: "Has Take Out Meal",
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:25:17
     },
     {
       Header: "Has Sack Meal",
-      accessor: "hasSackMeal",
+      accessor: "",
       Cell: ({ value }) => (value ? "Yes" : "No"),
     },
killedBy: DiningCommonsTable tests renders table with data correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-hasSackMeal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:26:13
     {
       Header: "Has Sack Meal",
       accessor: "hasSackMeal",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests renders table with data correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:29:15
       Cell: ({ value }) => (value ? "Yes" : "No"),
     },
     {
-      Header: "Has Take Out Meal",
+      Header: "",
       accessor: "hasTakeOutMeal",
       Cell: ({ value }) => (value ? "Yes" : "No"),
killedBy: DiningCommonsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Has Take Out Meal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:31:13
     {
       Header: "Has Take Out Meal",
       accessor: "hasTakeOutMeal",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
     {
killedBy: DiningCommonsTable tests renders table with data correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] ArrowFunction
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:36:13
     {
       Header: "Has Dining Cam",
       accessor: "hasDiningCam",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
   ];
killedBy: DiningCommonsTable tests renders table with data correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable.js:36:45
     {
       Header: "Has Dining Cam",
       accessor: "hasDiningCam",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: ({ value }) => (value ? "Yes" : ""),
     },
   ];
killedBy: DiningCommonsTable tests renders table with data correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  No
Received:
