[Killed] BlockStatement
src/main/pages/HomePage.js:6:36
 import DiningCommonsTable from "main/components/UCSBAPIDiningCommons/UCSBAPIDiningCommonsTable";
 import { useBackend } from "main/utils/useBackend";
 
-export default function HomePage() {
-  // Fetch dining commons data from the backend
-  const { data: diningCommons } = useBackend(
-    ["/api/diningcommons/all"],
-    { method: "GET", url: "/api/diningcommons/all" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Dining Commons</h1>
-        <p>Here is the list of all UCSB Dining Commons:</p>
-        <DiningCommonsTable diningCommons={diningCommons} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HomePage() {}
 
killedBy: HomePage tests calls useBackend with correct arguments and renders dining commons
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ["/api/diningcommons/all"], {"method": "GET", "url": "/api/diningcommons/all"}, []

Number of calls: 0

[Killed] StringLiteral
src/main/pages/HomePage.js:10:15
   // Fetch dining commons data from the backend
   const { data: diningCommons } = useBackend(
     ["/api/diningcommons/all"],
-    { method: "GET", url: "/api/diningcommons/all" },
+    { method: "", url: "/api/diningcommons/all" },
     [],
   );
killedBy: HomePage tests calls useBackend with correct arguments and renders dining commons
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  ["/api/diningcommons/all"],
  Object {
-   "method": "GET",
